import z from "zod";

export const placeFormSchema = z.object({
    FIRSTNAME: z.string()
        .trim()
        .min(1, 'Введите имя')
        .min(2, 'Имя должно содержать минимум 2 символа')
        .max(50, 'Имя слишком длинное')
        .regex(
            /^[А-ЯЁа-яёA-Za-z]+(-[А-ЯЁа-яёA-Za-z]+)*$/,
            'Имя может содержать только буквы и дефис'
        ),

    LASTNAME: z.string()
        .trim()
        .min(1, 'Введите фамилию')
        .min(2, 'Фамилия должна содержать минимум 2 символа')
        .max(50, 'Фамилия слишком длинная')
        .regex(
            /^[А-ЯЁа-яёA-Za-z]+(-[А-ЯЁа-яёA-Za-z]+)*$/,
            'Фамилия может содержать только буквы и дефис'
        ),

    COUNTRY: z.string()
        .trim()
        .min(1, 'Введите название страны')
        .min(2, 'Название слишком короткое')
        .max(100, 'Название слишком длинное')
        .regex(
            /^[А-ЯЁа-яёA-Za-z]+([ -][А-ЯЁа-яёA-Za-z]+)*$/,
            'Название может содержать только буквы, пробел и дефис'
        ),

    CITY: z.string()
        .trim()
        .min(1, 'Введите название города')
        .min(2, 'Название слишком короткое')
        .max(100, 'Название слишком длинное')
        .regex(
            /^[А-ЯЁа-яёA-Za-z]+([ -][А-ЯЁа-яёA-Za-z]+)*$/,
            'Название может содержать только буквы, пробел и дефис'
        )
})

export type PlaceFormSchema = z.infer<typeof placeFormSchema>